In [17]:
import pandas as pd
import numpy as np

In [18]:
df = pd.read_csv('../submit/0930_submit.csv',header=None)

In [19]:
df

           0              1
0      31471  128122.611200
1      31472  111817.797327
2      31473   81567.732244
3      31474   61333.068290
4      31475  105921.243326
...      ...            ...
31257  62728  110400.214857
31258  62729  104427.851981
31259  62730  176150.940793
31260  62731  262516.447311
31261  62732   82013.715781

[31262 rows x 2 columns]

In [20]:
# df[1] = round(df[1])
df[1] = df[1].astype(np.int64)

In [21]:
df.dtypes

0    int64
1    int64
dtype: object

In [22]:
df

           0       1
0      31471  128122
1      31472  111817
2      31473   81567
3      31474   61333
4      31475  105921
...      ...     ...
31257  62728  110400
31258  62729  104427
31259  62730  176150
31260  62731  262516
31261  62732   82013

[31262 rows x 2 columns]

In [11]:
df

           0       1
0      31471  114616
1      31472  117451
2      31473   72581
3      31474   57862
4      31475   89747
...      ...     ...
31257  62728  104675
31258  62729   99212
31259  62730  171962
31260  62731  215520
31261  62732   77576

[31262 rows x 2 columns]

In [8]:
df.to_csv('../submit/0930_submit.csv',index=False,header=None)